In [5]:
import pandas as pd

grades = pd.read_csv('ICA1.csv', index_col = "Name")

grades

          Potion1  Charm1  Potion2  Charm2
Name
Harry          85      90       88      90
Hermione       96     100       99     100
Ron            85      90       75      85
Ginny          90      60       80      89
Neville        76      40       60      16
Luna           79      76       89     100

In [6]:
grades.loc["Harry":"Ron", ["Charm1", "Charm2"]]

          Charm1  Charm2
Name
Harry         90      90
Hermione     100     100
Ron           90      85

In [9]:
grades.T.mean()

Name
Harry       88.25
Hermione    98.75
Ron         83.75
Ginny       79.75
Neville     48.00
Luna        86.00
dtype: float64